Конфигурация/Catalogs/ЮрФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЮрФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЮрФизЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/ЮрФизЛица/Forms/ФормаВыбора/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаИмпортироватьОбъектыИзМатрикс(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица");
	Иначе
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица");
	КонецЕсли;
	
	РаботаСНормативноСправочнойИнформациейКлиент.ИмпортироватьНовыйОбъектИзМатрикс(ГруппаОбъектов, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьВыделенныеОбъектыИзМатрикс(Команда)
	
	РаботаСВнешнимиСистемами.ОбновитьВыделенныеОбъектыИзМатрикс(Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ТекущиеДанные.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ФизическиеЛица");
	Иначе
		ГруппаОбъектов = ПредопределенноеЗначение("Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица");
	КонецЕсли;
	
	РаботаСНормативноСправочнойИнформациейКлиент.ИмпортироватьНовыйОбъектИзМатрикс(ГруппаОбъектов, Элементы.Список);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("Период", ЭтаФорма.Период) Тогда
		ЭтаФорма.Период = ТекущаяДата();
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ОтображатьТолькоКлиентов") Тогда
		ЭтаФорма.ОтображатьТолькоКлиентов = ЭтаФорма.Параметры.ОтображатьТолькоКлиентов;
	КонецЕсли;

	Справочники.ЮрФизЛица.ПодготовитьДинамическийСписокФормыСпискаВыбора(ЭтаФорма);
	
	Параметры.Свойство("СписокПеречнейВКоторыеВходитОбъект", СписокПеречнейВКоторыеВходитОбъект);
	
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоВходящиеВПеречни",	СписокПеречнейВКоторыеВходитОбъект.Количество() > 0);
	Список.Параметры.УстановитьЗначениеПараметра("СписокПеречней",			СписокПеречнейВКоторыеВходитОбъект);
	
	Если Параметры.Свойство("Клиент") Тогда
		ГруппаОтбора = Список.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Клиент");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение	= Параметры.Клиент;
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("ЭтоГруппа");
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование		= Истина;
		ЭлементОтбора.ПравоеЗначение	= Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ЭтаФорма.Список.Параметры.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	
КонецПроцедуры

#Область ВнутренниеПеречни

&НаКлиенте
Процедура ОтборВнутренниеПеречниПриИзменении_Подключаемый(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, ЭтаФорма[Элемент.Имя]);
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВнутренниеПеречни(Команда)
	
	Элементы.КомандаВнутренниеПеречни.Пометка = Не Элементы.КомандаВнутренниеПеречни.Пометка;
	
	Элементы.ГруппаВнутренниеПеречни.Видимость			= Элементы.КомандаВнутренниеПеречни.Пометка;
	Элементы.ГруппаВнутренниеПеречниОтборы.Видимость	= Элементы.КомандаВнутренниеПеречни.Пометка;
	
	УстановитьПараметрыОтборовВнутренниеПеречни(ЭтаФорма);
		
	ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыОтборовВнутренниеПеречни(Форма)
	
	Для Каждого Элемент Из Форма.Элементы.ГруппаВнутренниеПеречниОтборы.ПодчиненныеЭлементы Цикл
		Если Форма.Элементы.КомандаВнутренниеПеречни.Пометка Тогда
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Форма[Элемент.Имя]);
		Иначе
			Форма.Список.Параметры.УстановитьЗначениеПараметра(Элемент.Имя, Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.КомандаВнутренниеПеречни.Пометка			= (Настройки.Получить("КомандаВнутренниеПеречниПометка") = Истина);
	
	Элементы.ГруппаВнутренниеПеречни.Видимость			= Элементы.КомандаВнутренниеПеречни.Пометка;
	Элементы.ГруппаВнутренниеПеречниОтборы.Видимость	= Элементы.КомандаВнутренниеПеречни.Пометка;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("КомандаВнутренниеПеречниПометка", Элементы.КомандаВнутренниеПеречни.Пометка);
	
КонецПроцедуры

#КонецОбласти
